# Space Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space Class
Members See Also
---
Provides access to the space topology in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Space : SpatialElement
```

Visual Basic
---
```text
Public Class Space _
	Inherits SpatialElement
```

Visual C++
---
```text
public ref class Space : public SpatialElement
```

# Remarks
The space object can be queried for its boundary for use in space planning tools.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..SpatialElement Autodesk.Revit.DB.Mechanical..::..Space
# See Also
Space Members
Autodesk.Revit.DB.Mechanical Namespace